Praktika_Turina_2025/src/Documents/УстановкаЗатратНаРебенкаВМесяцПоДОП/УстановкаЗатратНаРебенкаВМесяцПоДОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЗатратНаРебенкаВМесяцПоДОП</name>
  <registerRecords>InformationRegister.ЗатратыНаРебенкаВМесяц</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлатныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.ПлатныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатратыНаРебенкаВМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Praktika_Turina_2025/src/InformationRegisters/ЗатратыНаРебенкаВМесяц/ЗатратыНаРебенкаВМесяц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗатратыНаРебенкаВМесяц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗатратыНаРебенкаВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВозрастОбучающихся</name>
    <type>
      <types>EnumRef.ВозрастОбучающихся</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяОбщеобразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ДОП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПлатныеУслуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Praktika_Turina_2025/src/Documents/УстановкаЗатратНаРебенкаВМесяцПоДОП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗатратыНаРебенкаВМесяц
	Движения.ЗатратыНаРебенкаВМесяц.Записывать = Истина;
	Для Каждого ТекСтрокаПлатныеУслуги Из ПлатныеУслуги Цикл
		Движение = Движения.ЗатратыНаРебенкаВМесяц.Добавить();
		Движение.Период = Дата;
		Движение.Услуга = ТекСтрокаПлатныеУслуги.Услуга;
		Движение.ЗатратыНаРебенкаВМесяц = ТекСтрокаПлатныеУслуги.ЗатратыНаРебенкаВМесяц;
		Движение.ДополнительнаяОбщеобразовательнаяПрограмма = ТекСтрокаПлатныеУслуги.Услуга.Владелец;
		Движение.ВозрастОбучающихся = ТекСтрокаПлатныеУслуги.Услуга.ВозрастОбучающихся;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
